{
    "asogVersion": "50",
    "processed": "2015-08-05T21:09:13.041Z",
    "form": "ASR",
    "section": "ADMINISTRATIVE",
    "name": "Activity Indicator",
    "title": "ACTI",
    "fieldNumber": "23",
    "fieldLength": "1",
    "characteristics": "Alpha",
    "usage": "Conditional",
    "example": [
        "C"
    ],
    "definition": "Identifies whether an order is an augment or a new trunk group and a partial or full disconnect.",
    "validEntry": [
        {
            "value": "A",
            "description": "Trunk Group Augment without translation changes"
        },
        {
            "value": "B",
            "description": "Trunk Group Augment with translation changes"
        },
        {
            "value": "C",
            "description": "New Trunk Group"
        },
        {
            "value": "D",
            "description": "Partial Trunk Group Disconnect"
        },
        {
            "value": "E",
            "description": "Full Trunk Group Disconnect and Traffic Re-route"
        },
        {
            "value": "",
            "description": "(Single service request process)"
        },
        {
            "value": "F",
            "description": "Full Trunk Group Disconnect and No Traffic to be Re-"
        },
        {
            "value": "",
            "description": "routed"
        }
    ],
    "validEntryNotes": [
        "An entry of “A” is valid for an increase in the number of trunks within an existing trunk group, with no changes made to the features or translations.",
        "An entry of “B” is valid for an increase in the number of trunks within an existing trunk group, with changes made to the features or translations.",
        "An entry of “C” is valid when ordering a new trunk group.",
        "An entry of “D” is valid for a decrease in the number of trunks within an existing trunk group, with no changes made to the features or translations.",
        "An entry of “E” is valid for the complete disconnect of a trunk group, and the re-route of traffic as defined in the attached TQ. ",
        "An entry of “F” is valid for the complete disconnect of a trunk group (no TQ will accompany this service request). "
    ],
    "usageNotes": [
        "Required when the first position of the REQTYP field is “M” and ACT field is “N”.  Valid ACTI values must be “A”, “B” or “C”.",
        "Required when the first position of the REQTYP field is “M” and the ACT field is “D”.  Valid ACTI values must be “D”, “E” or “F”.",
        "Otherwise prohibited."
    ],
    "fieldNotes": [
        ""
    ]
}