{
    "fieldNumber": "26",
    "title": "LATA",
    "name": "Local Access Transport Area",
    "definition": " Identifies the geographical area for the service being provided. ",
    "fieldNotes": [
        " It is anticipated that the termination point for this service is a point of presence  ( POP ) , a point of interconnection  ( POI )  or end user premises within this LATA. "
    ],
    "validEntries": [
        " A  = Dial Mobile or Paging  B  = Manual Mobile with DA allowance  C = Manual Paging  D = T ype Dial Live Line  E = T ype 1 Direct Inward Dial Trun k F = T ype 2A Tandem Interconnection  G = T ype 2B End Office Interconnection  H = T ype 1 Trunk Side Message Toll  J = T ype 2D Direct connection to a DA Tandem  K  = 2T Equal Access Tandem trunks  L  = 2C E911 to a selector router  M  = EO 251/252  End Office trunks (with full NXX)  N  = AX 251/252 Auxiliary trunk with basic 911%2C DA%2C OS and IC PIC  P  = ME 251/252 Modified End Office  ( Land to Mobile blocks of 100%E2%80%99s or 1000%E2%80%99s)  R = T D 251/252 Tandem trun k S = T T 251/252 Transit trunk (for IC traffic)  T = Direct connection to an operator tandem "
    ],
    "validEntryNotes": " An entry of \"A\" is valid for an increase in the number of trunks within an existing trunk group, w ith no changes made to the features or translations. \n An entry of \"B\" is valid for an increase in the number of trunks within an existing trunk group, with changes made to the features or translations. \n An entry of \"C\" is valid when ordering a new trun k group. \n An entry of \"D\" is valid for a decrease in the number of trunks within an existing trunk group, with no changes made to the features or translations.   \n An entry of \"E\" is valid for the complete disconnect of a trunk group, and the re-route of traffic as defined in the attached TQ. \n An entry of \"F\" is valid for the complete disconnect of a trunk group  ( no TQ will accompany this service request). ",
    "usage": " This field is optional. ",
    "dataCharacteristics": "Numeric",
    "fieldLength": "3",
    "usageNotes": " Prohibited when the first position of the REQTYP field is \"S\", \"W\", \"L\", \"R\", \"V\" or \"X\". \nProhibited when the ACT field is \"D\" and the ACTI field is \"D\" or \"F\". \nOtherwise optional. "
}