{
    "asogVersion": "50",
    "processed": "2015-08-04T17:08:46.829Z",
    "form": "ASR",
    "section": "ADMINISTRATIVE",
    "name": "Local Transport",
    "title": "LTP",
    "fieldNumber": "59",
    "fieldLength": "4",
    "characteristics": "AlphaNumeric",
    "usage": "Conditional",
    "example": [
        "DF11",
        "N"
    ],
    "definition": "Identifies the switched access local transport elements affected by this request.",
    "validEntry": "1\nst\nPosition (Elements to be ordered by this request)\nA = Entrance Facility (EF)\nB = Trunks, Tandem-Switched Transport and EF\nC = Trunks and Tandem-Switched Transport\nD = Lines/Trunks, Direct-Trunked Transport and EF to\nEnd Office\nE = Lines/Trunks and Direct-Trunked Transport to End\nOffice\nF = Lines/Trunks\nG = Direct-Trunked Transport and EF to End Office or Hub\nH = Direct-Trunked Transport to End Office or Hub\nI = Tandem-Switched Transport and EF\nJ = Direct-Trunked Transport to Access Tandem\nK = Direct-Trunked Transport and EF to Access Tandem\nL = Trunks and Direct-Trunked Transport to Access\nTandem\nM = Trunks, Direct-Trunked Transport and EF to Access\nTandem\nN = LTP not applicable\nP = Links, Direct-Link Transport and EF to STP\nQ = Direct-Link Transport and Links to STP\nR = Links2\nnd\nPosition (Identifies if element uses special access facility)\nA = EF rides special access facility\nB = Direct-Trunked Transport rides special access facility\nC = Direct-Trunked Transport and EF ride special access\nfacility\nD = Tandem-Switched Transport rides special access facility\nE = Tandem-Switched Transport and EF ride special access\nfacility\nF = No special access\n3\nrd\nPosition (Level of EF)\n0 = Voice grade capacity for the EF\n1 = DS1 capacity for the EF\n3 = DS3 capacity for the EF\n4\nth\nPosition (Level of Transport)\n0 = Voice grade capacity for transport\n1 = DS1 capacity for transport\n3 = DS3 capacity for transport",
    "validEntryNotes": [
        "When ordering local transport to an access tandem, the direct-trunked transport valid entries should be used for flat-rated service. Tandem-switched transport valid entries should be used for usage- rated service.",
        "When the first position is “A”, the fourth position is prohibited.",
        "When the first position is “C” or “E” and EF is being ordered separately, RPON is required. ",
        "When the first position is “N”, the second, third and fourth positions are prohibited.",
        "When the first position is “B” or “C”, the use of the fourth position may be prohibited based on provider tariffs/practices.",
        "Use of the third and fourth positions of this field is based on customer practices.",
        "When the first position of the REQTYP field is “L”, use of “B”, “C”, “D” or “E” in the second position is prohibited. "
    ],
    "usageNotes": [
        "Required when the first position of the REQTYP field is “M” or “A” and the ACT field is “N”, “C” or “D”.",
        "Required for switched access facilities when the ACT field is “N”, “C” or “D”.",
        "Optional when the first position of the REQTYP field is “L” and the ACT field is “N”, “C” or “D”.",
        "Otherwise prohibited."
    ],
    "fieldNotes": [
        ""
    ]
}