{
    "fieldNumber": "24",
    "title": "QSA",
    "name": "Quantity Service Address Location Information",
    "definition": " Identifies the total number of Service Address Location Information Forms being sent by the customer. ",
    "fieldNotes": [
        " QSA cannot be greater than \"01\" when the REQTYP field is \"E\" and the SEI field is populated. "
    ],
    "validEntries": [
        " A = T runk Group Augment without translation changes  B = T runk Group Augment with translation changes  C  = New Trunk Group  D  = Partial Trunk Group Disconnect  E  = Full Trunk Group Disconnect and Traffic Re-route (Single service request process)  F  = Full Trunk Group Disconnect and No Traffic to be Re- routed "
    ],
    "validEntryNotes": " An entry of \"A\" is valid for an increase in the number of trunks within an existing trunk group, w ith no changes made to the features or translations. \n An entry of \"B\" is valid for an increase in the number of trunks within an existing trunk group, with changes made to the features or translations. \n An entry of \"C\" is valid when ordering a new trun k group. \n An entry of \"D\" is valid for a decrease in the number of trunks within an existing trunk group, with no changes made to the features or translations.   \n An entry of \"E\" is valid for the complete disconnect of a trunk group, and the re-route of traffic as defined in the attached TQ. \n An entry of \"F\" is valid for the complete disconnect of a trunk group  ( no TQ will accompany this service request). ",
    "usage": "Conditional",
    "dataCharacteristics": "Numeric",
    "fieldLength": "2",
    "usageNotes": " Prohibited when the EVCI field is \"A\". \nRequired when the ACT field is \"N\" or \"T\", the first position of the REQTYP field is \"S\", \"E\", \"W\", \"V\" or \"X\", the NAG and SEI fields are not populated, and the first position of any PRILOC/SECLOC field is an \"E\".  \nRequired when the ACT field is \"N\" and the first position of the REQTYP field is \"R\" and the first position of the PRILOC field is \"E\" and the SPO T  ( PRI )  field is not a CLLI Code on the Ring or ARI Form.  \nRequired when the ACT field is \"N\" or \"T\" and the first position of the REQTYP field is \"A\" and the NSL field on the FGA Form is populated. \nRequired when the first position of the REQTYP is \"E\", the ACT field is \"M\" or \"N\" and the SEI field is populated. \nProhibited  w hen the first position of the REQTYP field is \"M\". \nProhibited when the first position of the REQTYP field is \"S\" and the SEI field is populated. 8%3A  Prohibited when the NAG field is populated.  Quantity Service Address Location Information (continued)9%3A Otherwise optional. "
}