{
    "asogVersion": "50",
    "processed": "2015-08-04T17:08:46.829Z",
    "form": "ASR",
    "section": "ADMINISTRATIVE",
    "name": "Quantity",
    "title": "QTY",
    "fieldNumber": "61",
    "fieldLength": "7",
    "characteristics": "Numeric",
    "usage": "Conditional",
    "example": [
        "6",
        "0006",
        "0000006"
    ],
    "definition": "Identifies the quantity of circuits, ring segments, BHMCs, or the percent of market share involved in this service request.",
    "validEntry": "",
    "validEntryNotes": [
        ""
    ],
    "usageNotes": [
        "Required when the ACT field is “N”, “C”, “D”, “M” or “T”, the second position of the TQ field is not “N” or “X”, and the EOD USE field on the EOD Form is not “A”.",
        "Prohibited when the second position of the TQ field is “N” or “X”.",
        "Prohibited when the EOD USE field on the EOD Form is “A”.",
        "Otherwise optional."
    ],
    "fieldNotes": [
        "The UNIT field entry will define this field as circuits, ring segments, BHMCs, or percent of market share.",
        "To accommodate the ordering of trunks to an Access Tandem when it is required to adjust the quantity due to an overflow occurrence, a zero would be used in this field for customers not allowed to order in trunks.  The number of trunks would be specified in REMARKS and a “B” would be entered in the “UNIT” field.",
        "When a “B” or a “C” is entered in the UNIT field and a “3” (two way) is entered in the TTT field on the Trunking Form then two traffic types may be specified in the TRFTYP field on the Trunking Form.",
        "If more than one access circuit or facility is involved, the circuits must have identical transmission and switching characteristics. Furthermore, all of the request information (including the desired due date), except for the circuit IDs, must be the same for all circuits involved.",
        "If this order is a change, rearrangement or add of a leg to a multipoint circuit (no change in circuit quantity) then the customer will enter a one (1) in this field.  (NSL entry will indicate the number of legs with activity.)",
        "On a new request for additional QTY or on a disconnect request for reducing the existing QTY, only the amount to be added or disconnected should be entered here.  On a supplement to change the QTY on a pending order, the entire new desired QTY should be entered here. In the latter case, a description of what the customer wants done is required in the REMARKS field. For example, if a customer has 10 circuits working and wished to remove 3 of them, they should send in a disconnect request for 3 circuits (QTY=3). If, on the other hand, the customer places an order for 10 circuits and then decides they don't want 3 of them before the order is completed, they should send in a supplement to the original new request that shows the new QTY desired, i.e., 7 circuits (QTY=7).",
        "A multipoint circuit is considered to be one circuit. Only 1 multipoint circuit may be requested per Access Service Request, as interpreted herein.",
        "QTY must be equal to one (1) if NVC on the Transport or EUSA Form is greater than zero (0). (NVC entry on the service specific form will indicate the number of VC with activity).",
        "QTY must be equal to one (1) when the EVCI field is populated. (NUT field on the EVC form will indicate the number of UNI terminations with activity)."
    ]
}