{
    "asogVersion": "0050",
    "processed": "2015-08-06T17:06:04.288Z",
    "form": "ASR",
    "section": "ADMINISTRATIVE",
    "name": " Additional Point of Termination",
    "title": "APOT",
    "fieldNumber": "70",
    "minimumLength": " ",
    "maximumLength": "11",
    "characteristics": "AlphaNumeric",
    "usage": "Conditional",
    "example": "  MILNTNMAFXX B17-P5-JK24",
    "definition": "  Further identifies the physical ACTL Point of Termination. ",
    "validEntry": [],
    "validEntryNotes": [],
    "usageNotes": [
        "Required when the ACTL field does not identify the   specific physical termination point of the access   service.",
        "Prohibited when the ACT field is “D”.",
        "Otherwise optional."
    ],
    "fieldNotes": [
        "This field may be a CLLI Code or a narrative format   to identify a termination location within an ACTL.   For example the customer may pre-assign cross-   connect information for its service-to-service order   coordination.",
        "When the entry in this field contains a CLLI Code   the format and structure of this field is defined by    ANSI in document T1.253 Identification of   Location Entities for the North American   Telecommunications System.  The CLLI Code   consists of the following elements:    the designation for a single geographical locality within   a state province territory country or distinct region of   the world (e.g. municipality) (4 alpha characters).    designation of a state or territory of the United States a    province or territory of Canada another country having   a national federal government or a unique designation   (2 alpha characters).    designation of a site of an existing or proposed   structure within a geographical location where there is   a need to identify one or more telecommunications   equipment entities facility terminations nodal   locations or administrative operations (2 alpha or 2   numeric characters.    describe the functional category of equipment or work   center that is contained in a structure. Equipment   categories including central office switching and   ancillary equipment or non-switching or access   terminations are associated with a building or network   site for purposes of maintaining equipment inventories   and for identifying facility and circuit terminations and   nodal locations  (3 alpha/numeric characters).",
        "Valid CLLI Codes are outlined in Telcordia   Technologies practice BR 795-(100-186)-100."
    ],
    "exampleNotes": []
}