{
    "asogVersion": "0050",
    "processed": "2015-08-07T17:14:57.123Z",
    "form": "ASR",
    "section": "ADMINISTRATIVE",
    "name": " Exchange Company Circuit ID",
    "title": "ECCKT",
    "fieldNumber": "60",
    "minimumLength": "",
    "maximumLength": "53",
    "characteristics": "AlphaNumeric",
    "usage": "Conditional",
    "definition": " Identifies the provider circuit ID or multiple circuit IDs.  ",
    "validEntry": [
        {
            "value": "",
            "description": "1. COMMON LANGUAGE Special Service Circuit Codes"
        },
        {
            "value": "",
            "description": "Structure for the Identification of Telecommunications"
        },
        {
            "value": "",
            "description": "Connections for the North American Telecommunications"
        },
        {
            "value": "",
            "description": "Systems or by COMMON LANGUAGE in BR-795-402-"
        },
        {
            "value": "",
            "description": "100. A brief summary of the format can be found in"
        },
        {
            "value": "",
            "description": "ASOG Practice 000 Section 2.14.3 and 2.14.4."
        },
        {
            "value": "",
            "description": ""
        }
    ],
    "validEntryNotes": [
        "For identification of an unbundled multiplexer  (including the collocation cross-connect) unbundled transport or a high capacity facility to a HUB  location.",
        "Either Location A or Z must be 11 characters."
    ],
    "usageNotes": [
        "Prohibited when the EVCI field is “A”.",
        "Required when the ACT field is “C” “D” “M” or “T”   and the first position of the TQ field is not “S”.",
        "Required when the ACT field is “N” the first   position of the TQ field is not “S” and the CCVN   field is populated.",
        "Required when the ACT field is “N” or “R” the first   position of the TQ field is not “S” and an ECCKT   has been previously provided to the customer.",
        "Otherwise optional."
    ],
    "fieldNotes": [
        "The provider assigning this circuit identifier   determines the content of this field in accordance   with COMMON LANGUAGE standards maintained   by Telcordia Technologies.",
        "When a component within the format is purposely   omitted the component should still be delimited   and compressed to eliminate any spaces.",
        "All components within the ECCKT should be   delimited by either virgules or periods.",
        "If all positions in a component within the ECCKT   are not populated the component should be   compressed to eliminate any spaces.",
        "Use of ranging is based on customer/provider   negotiations. Ranges should be shown within the   appropriate component of the ID by specifying the   lowest value of the component hyphen highest   value of the component e.g. trunk numbers 3500   through 3512 would be shown as 3500-3512.",
        "When disconnecting all circuits in a given account   “ALL” should be entered in this field the BAN field   populated and the ACT field should contain a “D”.",
        "The COMMON LANGUAGE Special Service Circuit    Code in this field should not reflect a value that    equates to the EVC circuit identification.",
        "The format and structure of the field is defined by   ANSI standards.",
        ""
    ],
    "exampleNotes": []
}