{
    "asogVersion": "0050",
    "processed": "2015-08-05T20:45:39.748Z",
    "form": "ASR",
    "section": "ADMINISTRATIVE",
    "name": " Local Transport",
    "title": "LTP",
    "fieldNumber": "59",
    "minimumLength": " ",
    "maximumLength": "4",
    "characteristics": "AlphaNumeric",
    "usage": "Conditional",
    "example": "  DF11 N",
    "definition": "  Identifies the switched access local transport elements affected by this request.  ",
    "validEntry": [
        {
            "value": "1 st  Position (Elements to be ordered by this request)  A",
            "description": "Entrance Facility (EF)  B"
        },
        {
            "value": "1 st  Position (Elements to be ordered by this request)  A",
            "description": "Entrance Facility (EF)  B"
        },
        {
            "value": "2 nd  Position (Identifies if element uses special access facility)  A",
            "description": "EF rides special access facility  B"
        }
    ],
    "validEntryNotes": [
        "When ordering local transport to an access tandem the direct-trunked transport valid entries should be used for flat-rated service. Tandem-switched transport valid entries should be used for usage- rated service.",
        "When the first position is “A” the fourth position is prohibited.",
        "When the first position is “C” or “E” and EF is being ordered separately RPON is required.",
        "When the first position is “C” or “E” and EF is being ordered separately RPON is required.",
        "When the first position is “N” the second third and fourth positions are prohibited.",
        "When the first position is “B” or “C” the use of the fourth position may be prohibited based on provider tariffs/practices.",
        "Use of the third and fourth positions of this field is based on customer practices.",
        "When the first position of the REQTYP field is “L” use of “B” “C” “D” or “E” in the second position is prohibited."
    ],
    "usageNotes": [
        "Required when the first position of the REQTYP   field is “M” or “A” and the ACT field is “N” “C” or   “D”.",
        "Required for switched access facilities when the   ACT field is “N” “C” or “D”.",
        "Optional when the first position of the REQTYP   field is “L” and the ACT field is “N” “C” or “D”.",
        "Otherwise prohibited."
    ],
    "fieldNotes": [],
    "exampleNotes": []
}