{
    "asogVersion": "50",
    "processed": "2015-08-10T17:22:32.891Z",
    "form": "ASR",
    "section": "ADMINISTRATIVE",
    "name": "Activity",
    "title": "ACT",
    "fieldNumber": "22",
    "minimumLength": "",
    "maximumLength": "1",
    "characteristics": "Alpha",
    "usage": "Required",
    "example": "",
    "definition": "Identifies the activity involved in this service request.",
    "validEntry": [
        {
            "value": "C",
            "description": "Change or modification to an existing service"
        },
        {
            "value": "D",
            "description": "Disconnection or decrease in capacity"
        },
        {
            "value": "M",
            "description": "Inside move of the physical termination within a"
        },
        {
            "value": "",
            "description": "building"
        },
        {
            "value": "N",
            "description": "New installation or increase in capacity."
        },
        {
            "value": "R",
            "description": "Record activity is for ordering administrative changes."
        },
        {
            "value": "T",
            "description": "Outside move of end user location"
        }
    ],
    "validEntryNotes": [
        "If the modification is exclusively an inside or outside move, an ACT of “M” or “T” respectively must be used, with the exception of multipoint services.",
        "When the second position of the TQ field is “N” or “X”, the ACT field entry must be “C” or “R”.",
        "Use of “C” is based on provider tariffs/contracts/negotiations.",
        "“C” may not be used to migrate to or from Unbundled Network Elements.",
        "“C” is prohibited for Combination Ethernet Virtual Connection (EVCI = “B”) services. ",
        "Inside move excludes deregulated inside wire.",
        "“M” is prohibited for multipoint, broadband (REQTYP = “V”) and Ethernet Virtual Connection (EVCI = “A”, “B”) services. ",
        "A billing account number change is not supported by the ASR.  Such requests are to be processed using provider procedures.",
        "Administrative changes may be chargeable under provider tariffs.",
        "When the second position of the TQ field is “N” or “X”, the ACT field entry must be “C” or “R”.",
        "When the EOD USE field on the EOD Form is “A”, the ACT field entry must be “R”. ",
        "“T” is prohibited for Feature Group A, B, C, D, local trunking, multipoint, broadband (REQTYP = “V”) and Ethernet Virtual Connection (EVCI = “A”, “B”) services.",
        "Such moves are permitted for special access and WATS Access lines when terminated at an end user location (other than an ACTL). ",
        "Outside moves are accommodated on a single customer order with the stipulation that the BAN (Billing Account Number), the NC (Network Channel Code), ACTL (Access Customer Terminal Location) and the ECCKT are provided and are the same as for the existing circuit being moved. MULTIPOINT ORDERING: Multipoint activity specific rules are covered in the following matrix describing the use of ACT as it relates to the LEGACT field on the MSL Form: Type of ActivityACT entry LEGACT entry New Connect N N Complete Disconnect D D Add Leg C N Disconnect Leg C D Inside Move Leg C M Outside Move Leg C N & D * Change Leg C C Record R R Cancel a Leg K * 2 MSLs required",
        "If the disconnect of a Leg(s)on an existing multipoint configuration causes it to change to a two point configuration, two ASRs may be required depending on provider procedures. If two ASRs are required, one would contain an ACT of “D” and the other “N”. Use of the RPON field along with remarks would be necessary in an effort to be sure that there is no interruption of service. ",
        "If the customer wishes to cancel a request for a leg or legs of a multipoint configuration, the LEGACT of “K” will be used.  However, if the cancellation causes it to change to a two-point configuration, the original request should be cancelled and a new request submitted for the two-point configuration. RING ORDERING: Ring activity specific rules are covered in the following matrix describing the use of ACT as it relates to the SEGACT field on the RING or ARI Form: Type of ActivityACT entry SEGACT entry New Connect N N/A Complete Disconnect D N/A Add Segment* C N Disconnect Segment* C D Inside Move Segment N/A N/A Outside Move Segment N/A N/A Node allocation change C C Recap of Segment C R *Adding and disconnecting segments supports the “move” activities VIRTUAL CONNECTION ORDERING:Virtual Connection activity specific rules are covered in the following matrix describing the use of ACT as it relates to the VCACT field on the VC Form:  Type of ActivityACT entry VCACT entry New NNI/UNI  with  VCN N Complete Disconnect D D Add VC C N Disconnect VC C D Inside Move of /UNI M C or R Outside Move of /UNI T C or N Change VC C C Record Activity R R Cancel a VC K",
        "If the customer wishes to cancel a request for a VC, the VCACT of “K” will be used. ETHERNET VIRTUAL CONNECTION ORDERING: Ethernet Virtual Connection activity specific rules are covered in the following matrix describing the use of ACT as it relates to the UACT and LOSACT fields on the EVC Form. For a stand alone request the ASR ACT represents the activity of the EVC/OVC. For a combination request the ASR ACT represents the activity of both the physical port and the EVC/OVC.  Type of ActivityASR ACT  UACT LOSACT New Connect N N N Complete Disconnect of EVC D D Add UNI Termination  C 1 N N Disconnect UNI/ENNI Termination C 1 D Change EVC/OVC (includes changes to a UNI/ENNI termination) C 1 N, C, D N, C, D Record Activity R R Cancel UNI/ENNI Termination N, C1, D, RK Cancel a Level of Service (LOS)  N, C1K Inside Move Segment N/A N/A  N/A Outside Move Segment N/A N/A N/A",
        "If the customer wishes to cancel a request for a UNI/ENNI termination the UACT of “K” will be used. The UACT of “K” will imply that all LOS activity associated with the cancelled UNI/ENNI termination will also be cancelled. 1 Activity of “C” is not applicable for a combination request. ",
        "If the customer wishes to cancel a request for a LOS, but the UNI/ENNI termination remains intact on the request, the LOSACT of “K” will be used. "
    ],
    "usageNotes": [
        ""
    ],
    "fieldNotes": [
        "The activity defined in this field is circuit activity from the customer perspective and does not necessarily reflect the type of provider order activity that would result.",
        "On a supplement to a request this field carries the original activity type."
    ],
    "exampleNotes": [
        ""
    ]
}